# Chapter 7

In [4]:
import numpy as np

In [5]:
import pandas as pd

In [6]:
float_data = pd.Series([1.2,-3.5,np.nan,0])

In [7]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

isna returns a Boolean Series with True where values are Null

In [8]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data= pd.Series(["aardvark",np.nan,None,"avacodo"])

In [11]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [12]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [13]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
string_data

0    aardvark
1         NaN
2        None
3     avacodo
dtype: object

In [14]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

Table 7.1: NA handling object methods
Method	Description
dropna	Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.
fillna	Fill in missing data with some value or using an interpolation method such as "ffill" or "bfill".
isna	Return Boolean values indicating which values are missing/NA.
notna	Negation of isna, returns True for non-NA values and False for NA values.

In [15]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

to get rid of missing values you can use:

In [16]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

how="all" will drop only rows that are all NA

In [20]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4] = np.nan

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df = pd.DataFrame(np.random.standard_normal((7,3)))

In [25]:
df.iloc[:4,1]= np.nan

In [26]:
df.iloc[:2,2]= np.nan

In [27]:
df

          0         1         2
0 -0.452153       NaN       NaN
1  0.356482       NaN       NaN
2 -2.477344       NaN  1.694530
3 -0.813497       NaN  1.384661
4  0.412071  0.286997  0.728427
5  1.864801 -0.336883 -2.237841
6  0.878454  0.437450  0.491331

In [28]:
df.dropna()

          0         1         2
4  0.412071  0.286997  0.728427
5  1.864801 -0.336883 -2.237841
6  0.878454  0.437450  0.491331

In [29]:
df.dropna(thresh=2)

          0         1         2
2 -2.477344       NaN  1.694530
3 -0.813497       NaN  1.384661
4  0.412071  0.286997  0.728427
5  1.864801 -0.336883 -2.237841
6  0.878454  0.437450  0.491331

you can fill NA values with fillna

In [30]:
df

          0         1         2
0 -0.452153       NaN       NaN
1  0.356482       NaN       NaN
2 -2.477344       NaN  1.694530
3 -0.813497       NaN  1.384661
4  0.412071  0.286997  0.728427
5  1.864801 -0.336883 -2.237841
6  0.878454  0.437450  0.491331

In [31]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.452153  0.500000  0.000000
1  0.356482  0.500000  0.000000
2 -2.477344  0.500000  1.694530
3 -0.813497  0.500000  1.384661
4  0.412071  0.286997  0.728427
5  1.864801 -0.336883 -2.237841
6  0.878454  0.437450  0.491331

In [32]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [33]:
df.iloc[2:,1] = np.nan

In [34]:
df.iloc[4:,2] = np.nan

In [35]:
df

          0         1         2
0 -0.053300 -0.161874 -0.215193
1 -1.914635  0.244903  0.476386
2  1.707100       NaN -0.032552
3 -0.672713       NaN -0.159382
4  0.664807       NaN       NaN
5 -0.224003       NaN       NaN

In [36]:
df.fillna(method="ffill")

/var/folders/y_/88_bvhts341bf74krgd3hgch0000gp/T/ipykernel_4476/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -0.053300 -0.161874 -0.215193
1 -1.914635  0.244903  0.476386
2  1.707100  0.244903 -0.032552
3 -0.672713  0.244903 -0.159382
4  0.664807  0.244903 -0.159382
5 -0.224003  0.244903 -0.159382

In [37]:
df.fillna(method="ffill", limit=2)

/var/folders/y_/88_bvhts341bf74krgd3hgch0000gp/T/ipykernel_4476/3889071623.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.053300 -0.161874 -0.215193
1 -1.914635  0.244903  0.476386
2  1.707100  0.244903 -0.032552
3 -0.672713  0.244903 -0.159382
4  0.664807       NaN -0.159382
5 -0.224003       NaN -0.159382

In [38]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

in the  next example we fill the NA vaslues with the mean

In [39]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Table 7.2: fillna function arguments
Argument	Description
value	Scalar value or dictionary-like object to use to fill missing values
method	Interpolation method: one of "bfill" (backward fill) or "ffill" (forward fill); default is None
axis	Axis to fill on ("index" or "columns"); default is axis="index"
limit	For forward and backward filling, maximum number of consecutive periods to fill





Data Transformation

Removing Duplicates

In [40]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2": [1, 1, 2, 3, 3, 4, 4]})

In [41]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

find the duplicates with

In [42]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

and get rid of them with

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data["v1"] = range(7)

you can specify clumns with

In [45]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
        "pastrami", "corned beef", "bacon",
        "pastrami", "honey ham", "nova lox"],
        "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [48]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

you can use the map funcrtion to add these values to the df. accepts dictionary format

In [50]:
data["animal"] = data["food"].map(meat_to_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
def get_animal(x):
    return meat_to_animal[x]

In [53]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object




Replacing Values

In [54]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [55]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

to replace multiple values use

In [58]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

to replace each other those selected values use:

In [59]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

The argument passed can also be a dictionary:

In [60]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

The data.replace method is distinct from data.str.replace, which performs element-wise string substitution. We look at these string methods on Series later in the chapter.




Renaming Axis Indexes

In [61]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [62]:
def transform(x):
    return x[:4].upper()

In [63]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [64]:
data.index = data.index.map(transform)

In [65]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

If you want to create a transformed version of a dataset without modifying the original, a useful method is rename:

In [66]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [67]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11





Discretization and Binning

In [68]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [69]:
bins = [18, 25, 35, 60, 100]

In [70]:
age_categories = pd.cut(ages,bins)

In [71]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object. The output you see describes the bins computed by pandas.cut. Each bin is identified by a special (unique to pandas) interval value type containing the lower and upper limit of each bin:

In [72]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [73]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [74]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [75]:
pd.value_counts(age_categories)

/var/folders/y_/88_bvhts341bf74krgd3hgch0000gp/T/ipykernel_4476/3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

Note that pd.value_counts(categories) are the bin counts for the result of pandas.cut.

In the string representation of an interval, a parenthesis means that the side is open (exclusive), while the square bracket means it is closed (inclusive). You can change which side is closed by passing right=False:

In [76]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [77]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

with the code below we label the groups rather thean index them

In [78]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

If you pass an integer number of bins to pandas.cut instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data. Consider the case of some uniformly distributed data chopped into fourths:

In [79]:
data = np.random.uniform(size=20)

In [80]:
pd.cut(data, 4, precision=2)

[(0.046, 0.28], (0.046, 0.28], (0.52, 0.76], (0.52, 0.76], (0.76, 1.0], ..., (0.76, 1.0], (0.76, 1.0], (0.28, 0.52], (0.28, 0.52], (0.76, 1.0]]
Length: 20
Categories (4, interval[float64, right]): [(0.046, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 1.0]]

In [81]:
data = np.random.standard_normal(1000)

In [82]:
quartiles = pd.qcut(data,4,precision=2)

In [83]:
quartiles

[(-0.71, -0.035], (-0.71, -0.035], (-0.71, -0.035], (-0.035, 0.66], (-0.71, -0.035], ..., (-0.035, 0.66], (0.66, 3.07], (-0.035, 0.66], (-0.035, 0.66], (-0.035, 0.66]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.71, -0.71] < (-0.71, -0.035] < (-0.035, 0.66] < (0.66, 3.07]]

In [84]:
pd.value_counts(quartiles)

/var/folders/y_/88_bvhts341bf74krgd3hgch0000gp/T/ipykernel_4476/3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.71, -0.71]     250
(-0.71, -0.035]    250
(-0.035, 0.66]     250
(0.66, 3.07]       250
Name: count, dtype: int64

In [85]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.7039999999999997, -1.396]    100
(-1.396, -0.035]                 400
(-0.035, 1.289]                  400
(1.289, 3.068]                   100
Name: count, dtype: int64





Detecting and Filtering Outliers

In [86]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))

In [87]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001254    -0.047330     0.002736     0.016071
std       0.983766     1.007501     1.018587     1.001914
min      -3.508738    -3.387749    -2.763223    -3.455370
25%      -0.596535    -0.746285    -0.716582    -0.656998
50%       0.037671    -0.061620     0.000790     0.024035
75%       0.685338     0.647929     0.680158     0.683246
max       3.274192     3.604546     2.844635     3.623916

In [88]:
col = data[2]

In [89]:
col[col.abs() > 3]

Series([], Name: 2, dtype: float64)

To select all rows having a value exceeding 3 or 3, you can use the any method on a Boolean DataFrame:

In [90]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
123 -0.113654  3.217917  1.452087  0.265103
161  1.460423 -1.269988 -0.112829 -3.455370
165  0.925397 -3.387749 -0.420720 -0.484056
173  0.110363 -3.218631 -0.499329  1.183738
184  3.274192 -1.283537 -0.606506  0.515059
212 -1.402367  0.226104  0.450163  3.623916
281 -0.734076 -0.102224 -1.474250 -3.276932
293  1.617633 -1.499226 -1.679128  3.219143
431 -0.503438 -0.924991  2.244228 -3.451451
710  0.471386  3.604546  0.170257 -1.380043
877  3.146046 -1.070685 -1.985319  1.331011
914  0.216199  0.410394 -1.374428  3.290047
951 -3.508738  0.817234  0.120041 -0.382061

The parentheses around data.abs() > 3 are necessary in order to call the any method on the result of the comparison operation.

Values can be set based on these criteria. Here is code to cap values outside the interval 3 to 3:

In [91]:
data[data.abs() > 3] = np.sign(data) * 3

In [92]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001343    -0.047547     0.002736     0.016122
std       0.980745     1.002918     1.018587     0.994437
min      -3.000000    -3.000000    -2.763223    -3.000000
25%      -0.596535    -0.746285    -0.716582    -0.656998
50%       0.037671    -0.061620     0.000790     0.024035
75%       0.685338     0.647929     0.680158     0.683246
max       3.000000     3.000000     2.844635     3.000000

The statement np.sign(data) produces 1 and 1 values based on whether the values in data are positive or negative

In [93]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2  1.0  1.0 -1.0  1.0
3  1.0  1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0






Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is possible using the numpy.random.permutation function. Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering:

In [94]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))

In [95]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [96]:
sampler = np.random.permutation(5)

In [97]:
sampler

array([0, 4, 1, 2, 3])

In [98]:
df.take(sampler)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27

In [99]:
df.iloc[sampler]

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27

By invoking take with axis="columns", we could also select a permutation of the columns:

In [100]:
column_sampler = np.random.permutation(7)

In [101]:
column_sampler

array([6, 1, 2, 0, 4, 5, 3])

In [102]:
df.take(column_sampler, axis = "columns")

    6   1   2   0   4   5   3
0   6   1   2   0   4   5   3
1  13   8   9   7  11  12  10
2  20  15  16  14  18  19  17
3  27  22  23  21  25  26  24
4  34  29  30  28  32  33  31

In [103]:
df.sample(n=7, axis="columns")

    5   4   0   6   1   2   3
0   5   4   0   6   1   2   3
1  12  11   7  13   8   9  10
2  19  18  14  20  15  16  17
3  26  25  21  27  22  23  24
4  33  32  28  34  29  30  31

this allows you to take a random subeset with out replacement

to allow replacements use this instead

In [104]:
choices = pd.Series([5,7,-1,6,4])

In [105]:
choices.sample(n=10, replace= True)

1    7
3    6
3    6
1    7
3    6
2   -1
2   -1
2   -1
0    5
0    5
dtype: int64

Computing Indicator/Dummy Variables

In [106]:
df = pd.DataFrame({"key": ["b","b","a","c","a","b"],
                  "data1": range(6)})

In [107]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [108]:
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

dtype is passed here to change the output type from the default boolean to float instead

to add a prefix to the columns use:

In [109]:
dummies = pd.get_dummies(df["key"], prefix ="key", dtype=float)

In [110]:
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

then you can merge with other data

In [111]:
df_with_dummy = df[["data1"]].join(dummies)

In [112]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [113]:
mnames =  ["movie_id", "title", "genres"]

In [114]:
movies = pd.read_table("datasets/movielens/movies.dat", sep = "::", header = None, names=mnames, engine="python")

In [115]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

to get dummies with rows that fall into multiple categories use

In [116]:
dummies = movies["genres"].str.get_dummies("|")

In [117]:
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

Then, as before, you can combine this with movies while adding a "Genre_" to the column names in the dummies DataFrame with the add_prefix method:

In [118]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [119]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object


Note
For much larger data, this method of constructing indicator variables with multiple membership is not especially speedy. It would be better to write a lower-level function that writes directly to a NumPy array, and then wrap the result in a DataFrame.

example: A USEFUL recipe for statistical applications is to combine pandas.get_dummies with a discretization function like pandas.cut

In [123]:
np.random.seed(12345) # to make the example repeatable

In [124]:
values = np.random.uniform(size=10)

In [125]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [126]:
bins= [0,0.2,0.4,0.6,0.8,1]

In [127]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [129]:
s = pd.Series([1,2,3,None])

In [130]:
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [133]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

you can change the type of your missing value with:

In [143]:
s = pd.Series([1,2,3,None], dtype=pd.Int64Dtype())

In [144]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [145]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [146]:
s.dtype

Int64Dtype()

In [147]:
s[3]

In [148]:
s[3] is pd.NA

True

you can use shorthand for the type change:

In [151]:
s = pd.Series([1,2,3,None], dtype = "Int64")

pandas also has an extension type specialized for string data that does not use NumPy object arrays (it requires the pyarrow library, which you may need to install separately):

In [152]:
s = pd.Series(['one','two',None,'three'], dtype=pd.StringDtype())

In [153]:
s

0      one
1      two
2     <NA>
3    three
dtype: string

These string arrays generally use much less memory and are frequently computationally more efficient for doing operations on large datasets.





                                astype(example)

In [160]:
df = pd.DataFrame({"A": [1, 2, None, 4],
        "B": ["one", "two", "three", None],
        "C": [False, None, False, True]})

In [155]:
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [161]:
df["A"]= df["A"].astype("Int64")

In [164]:
df["B"]= df["B"].astype("string")

In [166]:
df["C"]= df["C"].astype("boolean")

In [167]:
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

Table 7.3: pandas extension data types


Extension type	Description



BooleanDtype	Nullable Boolean data, use "boolean" when passing as string



CategoricalDtype	Categorical data type, use "category" when passing as string



DatetimeTZDtype	Datetime with time zone



Float32Dtype	32-bit nullable floating point, use "Float32" when passing as string



Float64Dtype	64-bit nullable floating point, use "Float64" when passing as string



Int8Dtype	8-bit nullable signed integer, use "Int8" when passing as string



Int16Dtype	16-bit nullable signed integer, use "Int16" when passing as string



Int32Dtype	32-bit nullable signed integer, use "Int32" when passing as string



Int64Dtype	64-bit nullable signed integer, use "Int64" when passing as string



UInt8Dtype	8-bit nullable unsigned integer, use "UInt8" when passing as string



UInt16Dtype	16-bit nullable unsigned integer, use "UInt16" when passing as string



UInt32Dtype	32-bit nullable unsigned integer, use "UInt32" when passing as string



UInt64Dtype	64-bit nullable unsigned integer, use "UInt64" when passing as string




                            String Manipiulation

in this example we use the built-in String object methods split()
and strip to turn comma separated values in to a list while getting rid of extra whitespace.

In [169]:
val = "a,b,  guido"

In [183]:
pieces = [x.strip() for x in val.split(",")]

In [184]:
pieces

['a', 'b', 'guido']

In [187]:
"::".join(pieces)

'a::b::guido'

'a::b::guido'

Other methods are concerned with locating substrings. Using Pythons in keyword is the best way to detect a substring, though index and find can also be used:

In [188]:
"guido" in val

True

In [189]:
val.index(",")

1

In [195]:
val.find(":")

-1




count	Return the number of nonoverlapping occurrences of substring in the string



endswith	Return True if string ends with suffix



startswith	Return True if string starts with prefix




join	Use string as delimiter for concatenating a sequence of other strings



index	Return starting index of the first occurrence of passed substring if 




found in the string; otherwise, raises ValueError if not found




find	Return position of first character of first occurrence of substring in 



the string; like index, but returns 1 if not found




rfind	Return position of first character of last occurrence of substring in the 



string; returns 1 if not found



replace	Replace occurrences of string with another string



strip, rstrip, lstrip	Trim whitespace, including newlines on both sides, on the right side, or on the left side, respectively



split	Break string into list of substrings using passed delimiter



lower	Convert alphabet characters to lowercase



upper	Convert alphabet characters to uppercase



casefold	Convert characters to lowercase, and convert any region-specific variable character combinations to a common comparable form



ljust, rjust	Left justify or right justify, respectively; pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width




                            Regular Expressions

In [196]:
import re

In [197]:
text = "foo    bar\t baz   \tqux"

In [199]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

you can compile a regex for later use with

In [200]:
regex = re.compile(r"\s+")

this creates the regex object so you can call methods on it later

In [201]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

If, instead, you wanted to get a list of all patterns matching the regex, you can use the findall method:

In [202]:
regex.findall(text)

['    ', '\t ', '   \t']